// Пользователь вводит числа с клавиатуры а мы потом считаем 
// сколько среди них чисел больше 0
int Promt(string message)
{
    Console.WriteLine(message);    
}
